benchmarks/results/auth-serialization/test-signin/optimization-01/sar-metrics/wrk2/wrk_report.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signin
  2 threads and 4 connections
  Thread calibration: mean lat.: 664.695ms, rate sampling interval: 1357ms
  Thread calibration: mean lat.: 662.930ms, rate sampling interval: 1364ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   655.33ms   24.01ms 684.03ms   72.58%
    Req/Sec     1.07      0.26     2.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  660.99ms
 75.000%  675.84ms
 90.000%  679.42ms
 99.000%  684.54ms
 99.900%  684.54ms
 99.990%  684.54ms
 99.999%  684.54ms
100.000%  684.54ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     589.823     0.000000            1         1.00
     618.495     0.100000            7         1.11
     638.975     0.200000           13         1.25
     645.119     0.300000           19         1.43
     655.359     0.400000           26         1.67
     660.991     0.500000           31         2.00
     665.599     0.550000           36         2.22
     667.647     0.600000           38         2.50
     672.255     0.650000           41         2.86
     675.327     0.700000           46         3.33
     675.839     0.750000           48         4.00
     676.351     0.775000           49         4.44
     676.863     0.800000           50         5.00
     677.887     0.825000           52         5.71
     678.911     0.850000           53         6.67
     679.423     0.875000           56         8.00
     679.423     0.887500           56         8.89
     679.423     0.900000           56        10.00
     679.935     0.912500           57        11.43
     680.447     0.925000           58        13.33
     680.959     0.937500           59        16.00
     680.959     0.943750           59        17.78
     680.959     0.950000           59        20.00
     681.471     0.956250           60        22.86
     681.471     0.962500           60        26.67
     684.543     0.968750           62        32.00
     684.543     1.000000           62          inf
#[Mean    =      655.327, StdDeviation   =       24.012]
#[Max     =      684.032, Total count    =           62]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  91 requests in 30.01s, 76.78KB read
Requests/sec:      3.03
Transfer/sec:      2.56KB